//===============================================================
// #13 Напишите программу, которая выводит третью цифру заданного
// числа или сообщает, что третьей цифры нет.
//===============================================================

// чтение данных из консоли.
String? threeDigit = Console.ReadLine();
// получение данных.
if (threeDigit.Length >= 3)
{
    Char[] Array = threeDigit.ToCharArray();
    // вывод результата.
    Console.WriteLine(Array[2]);
}
else
{
    // вывод результата.
    Console.WriteLine("Третьей цифры нет");
}