//=========================================================================
// # 6 Напишите программу, которая на вход принимает число и выдает, 
// является ли число четным (делится ли оно на два без остатка).
//=========================================================================

// чтение данных из консоли.
string? inputLineA = Console.ReadLine();
// получение данных.
int inputNumberA = int.Parse(inputLineA);
int inputNumberB;

inputNumberB = inputNumberA % 2;
if (inputNumberB == 0)
{
  // вывод результата.
    Console.WriteLine("Четное");
}
else
{
  // вывод результата.
  Console.WriteLine("Не четное");  
}