//======================================================================
// # 5 Напишите программу, которая принимает на вход трехзначное число и 
//  на выходе показывет последнюю цифру этого числа.
//======================================================================

// чтение данных из консоли.
string? inputLine = Console.ReadLine();
// получение данных.
if (inputLine != null)
{
    int inputNumber = int.Parse(inputLine);
    if (inputNumber > 99 && inputNumber<1000)
    {
        int lastDigit = inputNumber%10;
        // вывод результата.
        Console.Write(lastDigit);
        
    }
}
