//=============================================================================
// # 10 Напишите программу, которая на вход принимает трёхзначное число
// и на выходе показывает вторую цифру этого числа.
//==============================================================================

// чтение данных из консоли.
String? threeDigit = Console.ReadLine();
// получение данных.
if (threeDigit.Length == 3)
{
    Char[] Array = threeDigit.ToCharArray();
    Console.WriteLine(Array[1]);
}
else
{
    // вывод результата.
    Console.WriteLine("Число не трёхзначное");
}
