//=====================================================================
// #14 Напишите программу, которая принимает на вход число и проверяет,
// кратно ли одновременно 7 и 23. 
//=====================================================================

// чтение данных из консоли.
string? inputLineA = Console.ReadLine();
// получение данных.
if (inputLineA != null)
// вывод результата.
    Console.Write(((int.Parse(inputLineA) % 7 == 0) && (int.Parse(inputLineA) % 23 == 0)) ? ("Кратно") : ("Не кратно"));
